{
  "backend/main.mo": "Main Motoko actor for the Mucit Evreni backend, implementing role-based access control, admin profile management, audio file storage, and blob storage via mixins.",
  "feature_evidence.json": "Feature evidence report confirming the creation of `frontend/public/app-ads.txt` for Google AdMob publisher verification at the root URL path.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components, pages, hooks, styles, and configuration files for the Mucit Evreni React app.",
  "frontend/ANDROID_WEBVIEW_SETUP.md": "Guide for converting the Mucit Evreni web app into an Android APK using Android Studio with a WebView, including project setup and AndroidManifest configuration steps.",
  "frontend/index.html": "Root HTML entry point with mobile/WebView optimizations, SEO meta tags, PWA manifest link, and a routing script for handling the `/gizlilik` privacy policy path.",
  "frontend/public/app-ads.txt": "Google AdMob publisher verification file declaring a DIRECT relationship for publisher ID pub-7936595519986908.",
  "frontend/public/manifest.json": "PWA web app manifest for Mucit Evreni defining app name, standalone display mode, theme colors, and icon references.",
  "frontend/src/App.tsx": "Main React application component with lazy-loaded routes, a permanent-cache QueryClient configuration, and view-state management covering all app screens including admin, student, and parent/teacher flows.",
  "frontend/src/components/activities/AnimalMatchGame.tsx": "An animal-emoji-to-name matching game activity with configurable difficulty levels, randomized animal pairs on left/right columns, scoring, and feedback.",
  "frontend/src/components/activities/ColorMatchGame.tsx": "A color swatch-to-name matching game activity with difficulty-based pair counts, randomized layout, sound effects, and score tracking.",
  "frontend/src/components/activities/CreativeGame.tsx": "A creative writing activity that presents a random design/invention prompt based on difficulty and awards points based on the word count of the user's response.",
  "frontend/src/components/activities/DetailFindGame.tsx": "A timed spot-the-difference game where players click on emoji items that differ from the majority in a grid, with difficulty controlling grid size, number of different items, and time limit.",
  "frontend/src/components/activities/LogicGame.tsx": "A pattern-completion game that generates emoji sequences based on pattern types (AB, ABC, AABB, etc.) and asks players to select the next item in the sequence, with difficulty controlling pattern complexity and question count.",
  "frontend/src/components/activities/MathGame.tsx": "A multiple-choice math quiz game that generates arithmetic questions tailored to age group (preschool, elementary, middle school) and difficulty, covering operations from simple addition to more complex math.",
  "frontend/src/components/activities/QuizGame.tsx": "A multiple-choice trivia quiz game using a hardcoded Turkish-language question database organized by difficulty (easy/medium/hard), covering topics like science, geography, and general knowledge.",
  "frontend/src/components/activities/ShapeMatchGame.tsx": "A shape-matching game where players pair shapes on the left column with their counterparts on the right column, with difficulty controlling the number of shapes and randomized colors and backgrounds each session.",
  "frontend/src/components/activities/SimulationGame.tsx": "A React component that presents science simulation experiments (water, energy, chemistry) where users adjust temperature, pressure, and volume sliders, then receive scored feedback based on difficulty level.",
  "frontend/src/components/activities/WordGame.tsx": "A React component implementing a Turkish syllable-ordering word game where players arrange shuffled syllables to form words, with difficulty-based word pools and scoring.",
  "frontend/src/components/ActivityList.tsx": "Activity list component defining 90 activities across three age groups and three difficulty levels, rendering them as cards with an integrated ActivityPlayer.",
  "frontend/src/components/ActivityPlayer.tsx": "Renders and manages the lifecycle of a selected educational activity/game, handling game completion, score tracking, achievement level updates via localStorage, and replay functionality.",
  "frontend/src/components/DailyPlanning.tsx": "A daily planning UI component that lets students add, edit, delete, and toggle completion of categorized daily plans for a selected calendar date, backed by React Query hooks.",
  "frontend/src/components/DersDisiGerecler.tsx": "A tabbed container component that organizes 'Mucit Gereçleri' (planning and tools cards) and 'Genel Kültür' sections, delegating to GenelKulturTabs and triggering modal callbacks for planning and tools.",
  "frontend/src/components/DifficultySelection.tsx": "Displays three difficulty level cards (easy, medium, hard) for the user to select before starting an activity, invoking an onSelect callback with the chosen difficulty.",
  "frontend/src/components/Footer.tsx": "A simple footer component showing copyright info and a privacy policy link that opens an external Google Sites page in a new tab.",
  "frontend/src/components/GenelKulturTabs.tsx": "A large general-knowledge tabbed component covering topics like nature, safety rules, and household hazards, with subcategories containing descriptive items, fun facts, scenarios, and interactive rule cards.",
  "frontend/src/components/Header.tsx": "A fixed top navigation header that displays the app logo, user avatar, username, total score, achievement level badge, and a progress bar, reading all user data directly from localStorage.",
  "frontend/src/components/Notebook.tsx": "A React component that provides a personal note-taking interface with add, edit, delete, and view functionality, storing notes in local state with Turkish UI text.",
  "frontend/src/components/PermissionDialog.tsx": "A dialog component that requests user permissions (notifications, camera, storage, microphone) with localized Turkish descriptions and confirm/cancel actions.",
  "frontend/src/components/ToolRouter.tsx": "A routing component that lazily loads and renders one of 18 educational tool pages based on a given toolId string prop.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an ICP backend actor using React Query, returning either an authenticated or anonymous actor based on the current Internet Identity, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status to child components via a React context provider.",
  "frontend/src/hooks/useNotifications.ts": "A custom hook that schedules browser push notifications with motivational messages every 2 hours and a bedtime reminder at 9 PM, clearing intervals when disabled or when the user/actor is unavailable.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for backend data operations including sound management, audio file CRUD, and student data synchronization, with helpers for converting between local and backend data formats.",
  "frontend/src/hooks/useSoundEffects.ts": "A custom hook that fetches sound files for each sound category from the backend and loads them into the global soundManager instance, returning the soundManager for playback use.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind CSS, defines CSS custom properties for light/dark themes using oklch colors, and applies responsive font sizing and layout resets.",
  "frontend/src/lib/imageOptimizer.ts": "Provides utility functions for image optimization including responsive sizes, preloading, dimension caching, and creating optimized image props for mobile performance.",
  "frontend/src/lib/performanceMonitor.ts": "Implements a PerformanceMonitor class that tracks long tasks, measures component render times using the Performance API, and exposes a React hook for component-level performance monitoring.",
  "frontend/src/lib/permissions.ts": "Provides async functions to request browser/WebView runtime permissions (notifications, camera, storage, microphone) with Turkish-language branded messages for the 'Mucit Evreni' app.",
  "frontend/src/lib/soundManager.ts": "Singleton SoundManager class that loads and plays categorized game sound effects via HTMLAudioElement, respecting a per-profile sound-enabled setting stored in localStorage.",
  "frontend/src/main.tsx": "React app entry point that mounts the root component wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page for managing game sounds and audio files, supporting upload via file or URL for categorized sound effects and general audio assets with playback and deletion controls.",
  "frontend/src/pages/AdminLogin.tsx": "Renders an admin login form with hardcoded credentials ('admin'/'king154') that calls an `onLogin` callback on success and displays error messages on failure.",
  "frontend/src/pages/AvatarSelection.tsx": "Allows a new user to pick an avatar and enter a username, generates a unique student number, saves the profile to localStorage and optionally syncs it to the backend via an actor.",
  "frontend/src/pages/ClassView.tsx": "Displays a class view for a given age group, letting users choose a difficulty level to browse activities or launch the DailyExam component.",
  "frontend/src/pages/DailyExam.tsx": "Implements a timed daily exam with age-appropriate question generation for preschool, elementary, and middle-school groups, tracking scores and preventing retakes on the same day.",
  "frontend/src/pages/DailyPlanner.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/EntrySelection.tsx": "Presents a landing screen with two entry options—student or parent/teacher—and triggers the corresponding callback when a card is clicked.",
  "frontend/src/pages/InventorTools.tsx": "Renders a grid of educational tool cards (calculator, ruler, graph builder, dictionary, etc.) and calls `onToolSelect` with the chosen tool's ID when clicked.",
  "frontend/src/pages/ParentTeacherDashboard.tsx": "A dashboard page for parents and teachers that allows searching for student data by entering a 16-digit student number, displaying progress stats, achievements, and sync guidance.",
  "frontend/src/pages/PlanetSelection.tsx": "A planet selection page where users choose an age group (preschool, elementary, middle school) represented as planets, and also provides access to planning and extra tools sections.",
  "frontend/src/pages/Planning.tsx": "A planning page with two tabs — a personal notebook and a daily planner — wrapping the Notebook and DailyPlanning components for a given user.",
  "frontend/src/pages/PrivacyPolicy.tsx": "A static privacy policy page detailing data collection practices, device permissions, and contact information for the Mucit Evreni children's learning platform.",
  "frontend/src/pages/ProfileSettings.tsx": "A profile settings page allowing users to update their username, avatar, notification, and sound preferences, and to copy or reset their student number.",
  "frontend/src/pages/tools/Calculator.tsx": "A calculator tool component supporting basic arithmetic operations, percentage, square root, and backspace, rendered with a styled numeric keypad UI.",
  "frontend/src/pages/tools/DateCalculator.tsx": "A React component that provides two date utilities: calculating the difference in days between two dates, and computing a person's age in years, months, and days from a birth date.",
  "frontend/src/pages/tools/DictionaryTool.tsx": "A React dictionary/translation tool supporting Turkish-English and English-Turkish lookups from a built-in word database, with voice search (microphone) and text-to-speech pronunciation features.",
  "frontend/src/pages/tools/EquationArea.tsx": "A React component that lets users configure a linear equation (ax + b = c) and walks through its step-by-step solution, also allowing the user to input and check their own answer.",
  "frontend/src/pages/tools/FormulaNotebook.tsx": "A React reference tool displaying math and physics formulas organized into tabbed categories (geometry, arithmetic, physics) with search filtering and a favorites toggle.",
  "frontend/src/pages/tools/FractionTool.tsx": "A React component for visualizing fractions via bar and pie chart models, with inputs for numerator and denominator, automatic simplification, and percentage conversion.",
  "frontend/src/pages/tools/GraphCreator.tsx": "A React component that lets users create bar or line charts by entering name/value data points, with add/remove functionality and live chart rendering via Recharts.",
  "frontend/src/pages/tools/MultiplicationTable.tsx": "A React component displaying an interactive 10×10 multiplication table where cells highlight on click and answers can be toggled visible or hidden.",
  "frontend/src/pages/tools/NoiseMeter.tsx": "A React component that uses the Web Audio API to measure real-time microphone noise levels in decibels, displaying a waveform and categorizing noise as silent, normal, loud, or dangerous.",
  "frontend/src/pages/tools/NumberLine.tsx": "A React component rendering an interactive number line that supports panning left/right and zooming in/out, highlighting the current position with a red marker.",
  "frontend/src/pages/tools/PlaceValue.tsx": "A React component that takes a numeric input (up to 7 digits) and visually breaks it down by place value (ones, tens, hundreds, etc.), showing each digit's positional value and the total.",
  "frontend/src/pages/tools/ProblemTemplate.tsx": "A Turkish math word-problem tool that lets users select from four operation templates (add, subtract, multiply, divide), adjust two numbers via inputs, enter an answer, and optionally reveal a hint.",
  "frontend/src/pages/tools/ReadingBar.tsx": "A reading-focus tool that highlights one line at a time in a pasted or sample Turkish text, with controls for font size and up/down line navigation.",
  "frontend/src/pages/tools/RulerAngle.tsx": "An interactive measurement tool with two tabs: a draggable ruler on a grid canvas and a protractor that rotates in 15-degree increments.",
  "frontend/src/pages/tools/ScratchPad.tsx": "A freehand drawing canvas with color palette, adjustable brush size, eraser, and clear functionality, supporting both mouse and touch input.",
  "frontend/src/pages/tools/ShapeDrawing.tsx": "A geometry tool that renders SVG shapes (circle, square, rectangle, triangle) with user-controlled size and color, and displays calculated area and perimeter.",
  "frontend/src/pages/tools/UnitConverter.tsx": "A React component that provides a unit conversion tool supporting length, weight, temperature, and time categories with dropdowns and swap functionality, with Turkish UI labels.",
  "frontend/src/pages/tools/WritingTool.tsx": "A React component for practicing Turkish letter and word writing, displaying a target character/word and validating user input with color-coded feedback.",
  "frontend/src/types/index.ts": "Defines shared TypeScript types and interfaces for the Mucit Evreni app, including user profiles, progress, daily plans, notes, and exam results.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, border radii, animations, and responsive container settings, using typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the project's current state, existing features, known issues, and pending feature requests including full i18n support, student number clipboard copy, and app-ads.txt creation."
}