{
  "backend/main.mo": "Actor with role-based access control, admin profile handling, and audio file upload/storage using blob storage.",
  "feature_evidence.json": "Feature evidence report linking a copy‑to‑clipboard student‑number feature to its related frontend file and components.",
  "frontend-file-summaries.txt": "List of short summaries describing key frontend files and components across the project.",
  "frontend/ANDROID_WEBVIEW_SETUP.md": "Guide explaining how to wrap the web app into an Android WebView APK using Android Studio.",
  "frontend/index.html": "Main HTML entry with mobile WebView optimizations, meta tags, and privacy‑policy routing helper.",
  "frontend/public/manifest.json": "Web app manifest defining icons, colors, display mode, and startup settings for the PWA.",
  "frontend/src/App.tsx": "Main React app root managing routing via state, lazy loading, and permanent production query configuration.",
  "frontend/src/components/activities/AnimalMatchGame.tsx": "Animal matching game that randomizes pairs, tracks score and attempts, and provides feedback.",
  "frontend/src/components/activities/ColorMatchGame.tsx": "Color matching game with randomized palettes, sound effects, scoring, and feedback handling.",
  "frontend/src/components/activities/CreativeGame.tsx": "Creative writing task generator that selects prompts and scores answers based on length and effort.",
  "frontend/src/components/activities/DetailFindGame.tsx": "Provides a timed spot-the-difference emoji game with dynamic grid sizes, randomized themes, and scoring based on correct selections.",
  "frontend/src/components/activities/LogicGame.tsx": "Generates repeating emoji pattern puzzles where players select the next item in the sequence, adjusting complexity by difficulty.",
  "frontend/src/components/activities/MathGame.tsx": "Creates randomized math questions tailored to age group and difficulty, with multiple-choice answers and scoring.",
  "frontend/src/components/activities/QuizGame.tsx": "Runs a multiple-choice knowledge quiz using a difficulty-based question bank with scoring and feedback.",
  "frontend/src/components/activities/ShapeMatchGame.tsx": "Implements a shape-matching game where players pair shapes from two lists, using randomized sets, colors, and difficulty-based counts.",
  "frontend/src/components/activities/SimulationGame.tsx": "Interactive experiment mini-game that randomizes scenario parameters and calculates results and scores based on difficulty. Handles simulation state, scenario switching, and triggers completion callbacks.",
  "frontend/src/components/activities/WordGame.tsx": "Word-building game where students assemble shuffled syllables to form words based on difficulty. Manages rounds, scoring, feedback, and random word selection.",
  "frontend/src/components/ActivityList.tsx": "Component defining activity data by age group and difficulty, and rendering selectable activities.",
  "frontend/src/components/ActivityPlayer.tsx": "Renders and manages interactive activity games, tracking visits, scores, and achievements via localStorage with completion and replay handling.",
  "frontend/src/components/DailyPlanning.tsx": "Displays and manages a daily planning calendar with CRUD operations for plans filtered by date using custom data hooks.",
  "frontend/src/components/DersDisiGerecler.tsx": "Provides tabbed UI for extra tools and cultural content, allowing navigation to planning or tools sections.",
  "frontend/src/components/DifficultySelection.tsx": "Shows selectable difficulty cards and triggers a callback with the chosen difficulty.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and opening the external privacy policy link.",
  "frontend/src/components/GenelKulturTabs.tsx": "Implements a large tab-based general knowledge module with nested categories, subcategories, content, and visuals.",
  "frontend/src/components/Header.tsx": "Displays a fixed header with user avatar, score, and achievement data loaded from localStorage, adapting style on scroll.",
  "frontend/src/components/Notebook.tsx": "Interactive notebook component allowing users to create, view, edit, and delete notes with dialog-based forms.",
  "frontend/src/components/PermissionDialog.tsx": "Displays a themed permission request dialog with icons, descriptions, and confirm/cancel actions.",
  "frontend/src/components/ToolRouter.tsx": "Lazy-loads and routes to various educational tool components based on a toolId value.",
  "frontend/src/hooks/useActor.ts": "Loads and caches the backend actor based on Internet Identity, recreating it when identity changes. Invalidates dependent queries whenever the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context for Internet Identity, handling login, logout, identity persistence, and client creation. Exposes identity state and status flags to consumers.",
  "frontend/src/hooks/useNotifications.ts": "Schedules motivational and bedtime notifications for a user when enabled. Uses the actor and browser Notification API with interval-based message dispatching.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for sounds, audio files, and student data sync, using the backend actor. Handles CRUD operations and query invalidation.",
  "frontend/src/hooks/useSoundEffects.ts": "Loads and initializes various sound effects from backend files into the sound manager. Reactively updates loaded sounds when backend data changes.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, color variables for light/dark themes, and responsive font/container rules.",
  "frontend/src/lib/imageOptimizer.ts": "Provides utilities for responsive images, preloading, dimension caching, and simple optimization logic.",
  "frontend/src/lib/performanceMonitor.ts": "Implements performance monitoring with observers, timing marks, memory checks, and a React hook for render timing.",
  "frontend/src/lib/permissions.ts": "Handles notification, camera, storage, and microphone permission requests with Android WebView detection and branded messages.",
  "frontend/src/lib/soundManager.ts": "Manages loading and playing categorized sound effects with a singleton sound manager and React hook.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminDashboard.tsx": "Provides an admin interface for uploading, listing, previewing, and deleting categorized sound and audio files.",
  "frontend/src/pages/AdminLogin.tsx": "Provides a simple admin login form with local credential check and UI feedback.",
  "frontend/src/pages/AvatarSelection.tsx": "Allows students to select an avatar, enter a username, generate a student number, and save their profile locally and to backend.",
  "frontend/src/pages/ClassView.tsx": "Displays age‑group content, difficulty selection, and access to daily exams or activity lists.",
  "frontend/src/pages/DailyExam.tsx": "Generates age‑specific daily exams, tracks progress, handles timing, scoring, and saves results locally and via mutation.",
  "frontend/src/pages/DailyPlanner.tsx": "Empty placeholder file.",
  "frontend/src/pages/EntrySelection.tsx": "Landing page offering selection between student login and parent/teacher login.",
  "frontend/src/pages/InventorTools.tsx": "Shows a selectable grid of utility tools (calculator, ruler, converter, etc.) for students with callbacks on selection.",
  "frontend/src/pages/ParentTeacherDashboard.tsx": "Dashboard for parents/teachers to search students by 16-digit number and view loading, error, or data states.",
  "frontend/src/pages/PlanetSelection.tsx": "Displays selectable age‑group planets and a tools section, greeting the user and triggering callbacks on selection.",
  "frontend/src/pages/Planning.tsx": "Provides planning tools with tabs for a notebook and daily planning, using stored student info and a close callback.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Shows the app’s privacy policy with sections on data use, permissions, and a back button.",
  "frontend/src/pages/ProfileSettings.tsx": "Allows editing profile info, avatar, and preferences, with save, copy, reset, and logout actions using query hooks.",
  "frontend/src/pages/tools/Calculator.tsx": "Implements a basic calculator with arithmetic operations, percent, square root, and back navigation.",
  "frontend/src/pages/tools/DateCalculator.tsx": "Provides a date difference and age calculator with input fields and computed results displayed in styled cards.",
  "frontend/src/pages/tools/DictionaryTool.tsx": "Implements a small bilingual dictionary with search, pronunciation, examples, voice input handling, and language selection.",
  "frontend/src/pages/tools/EquationArea.tsx": "Lets users configure a linear equation ax + b = c and view step-by-step solution guidance with validation of their answer.",
  "frontend/src/pages/tools/FormulaNotebook.tsx": "Displays categorized formulas with search and favorites, rendered as cards across tabbed sections.",
  "frontend/src/pages/tools/FractionTool.tsx": "Allows entering a fraction, computes simplification and percentage, and visualizes it via bar and pie models.",
  "frontend/src/pages/tools/GraphCreator.tsx": "Interactive graph creator allowing users to add/remove data points and switch between bar and line charts using Recharts.",
  "frontend/src/pages/tools/MultiplicationTable.tsx": "Displays a 10×10 multiplication table with optional answer hiding and cell highlight animation on click.",
  "frontend/src/pages/tools/NoiseMeter.tsx": "Microphone-based noise meter that analyzes audio levels in real time and categorizes them into predefined noise ranges with waveform visualization.",
  "frontend/src/pages/tools/NumberLine.tsx": "Interactive number line where users can move the pointer, zoom in/out, and visualize numeric positions dynamically.",
  "frontend/src/pages/tools/PlaceValue.tsx": "Breaks down a multi‑digit number into place values and visualizes each digit’s role with colored blocks and detailed calculations.",
  "frontend/src/pages/tools/ProblemTemplate.tsx": "Provides selectable math word problem templates, lets users adjust numbers, enter answers, and get correctness feedback with hints.",
  "frontend/src/pages/tools/ReadingBar.tsx": "Displays text with a movable highlight bar for focused reading, including font size control and editable input text.",
  "frontend/src/pages/tools/RulerAngle.tsx": "Offers draggable on-screen ruler and rotatable protractor tools using tabs for measurement interaction.",
  "frontend/src/pages/tools/ScratchPad.tsx": "Implements a drawable canvas with color palette, brush size, eraser, and clear functionality.",
  "frontend/src/pages/tools/ShapeDrawing.tsx": "Lets users draw geometric shapes, customize size and color, and view calculated area and perimeter.",
  "frontend/src/pages/tools/UnitConverter.tsx": "Provides a unit conversion tool with category switching, temperature-specific logic, and UI controls for converting between units.",
  "frontend/src/pages/tools/WritingTool.tsx": "Implements a practice tool for Turkish letters and words, allowing users to type inputs and get correctness feedback.",
  "frontend/src/types/index.ts": "Defines shared TypeScript types for age groups, user profiles, activities, plans, notes, and exam results.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, features, issues, and upcoming requests related to i18n and a copy-to-clipboard feature."
}